reynoldsNumberEffect/straightDiamond_76100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontandback
    {
        type            empty;
        inGroups        List<word> 1(wall);
        nFaces          57884;
        startFace       57492;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       115376;
    }
    diamond
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       115776;
    }
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       115876;
    }
    outlet
    {
        type            patch;
        nFaces          130;
        startFace       116006;
    }
)

// ************************************************************************* //
